app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @categories = Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @category = Category.friendly.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @category = Category.friendly.find(params[:id])

INSERT INTO "categories" ("label", "slug_url", "state") VALUES ($1, $2, $3) RETURNING "id"  [["label", "newCat"], ["slug_url", "newcat"], ["state", "public"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "categories" SET "label" = $1 WHERE "categories"."id" = $2  [["label", "Make upz"], ["id", 1]]
---
  def update
    @category = Category.friendly.find(params[:id])
    if @category.update_attributes(category_params)