app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("category_id", "name", "slug_url", "description", "state") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 532], ["name", "Prod1"], ["slug_url", "prod1-78afaac0-ab2c-4488-b01c-6d546c13f82a"], ["description", "testProd"], ["state", "public"]]