app/controllers/products_controller.rb

  def show
    @product = Product.friendly.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @product = Product.friendly.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("category_id", "name", "description", "state") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 2], ["name", "ola"], ["description", "hi"], ["state", "public"]]

  def update
    @product = Product.friendly.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1 WHERE "products"."id" = $2  [["name", "newpro"], ["id", 9]]

  def destroy
    @product = Product.friendly.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 7]]