app/controllers/variants_controller.rb

UPDATE "variants" SET "name" = $1 WHERE "variants"."id" = $2  [["name", "new title"], ["id", 56]]
---
  def update
    @variant = Variant.find(params[:id])
    if @variant.update_attributes(variant_params)