app/controllers/variants_controller.rb

SELECT "variants".* FROM "variants"
---
  def index
    @variants = Variant.all

SELECT  "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @variant = Variant.find(params[:id])

SELECT  "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @variant = Variant.find(params[:id])

INSERT INTO "variants" ("product_id", "name", "sold_out", "under_sale", "price", "sale_price", "sale_text") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["product_id", 1], ["name", "test"], ["sold_out", false], ["under_sale", true], ["price", 3700], ["sale_price", 3400], ["sale_text", "test"]]
---
  def create
    @variant = Variant.new(variant_params)
    @product = @variant.product
    if @variant.save

SELECT  "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "variants" SET "sale_text" = $1 WHERE "variants"."id" = $2  [["sale_text", ""], ["id", 1]]
---
  def update
    @variant = Variant.find(params[:id])
    if @variant.update_attributes(variant_params)

SELECT  "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "variants" WHERE "variants"."id" = $1  [["id", 12]]
---
  def destroy
    @variant = Variant.find(params[:id])
    @variant.destroy