app/views/products/show.html.erb

  <tbody>
  <% @product.variants.each do |variant| %>
---
SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = $1  [["product_id", 6]]